Repository: dinhquydds/nanocucurmin
Catalog: tm/itiv1-level2.tmx
Source language: en_us
Languages: vi

source: A stone working model was produced to fabricate an occlusally screw-retained permanent implant-supported crown (Figs 34a, b).
vi: A stone working model was produced to fabricate an occlusally screw-retained permanent implant-supported crown (Hình 34a, b).

source: A synOcta gold abutment was selected as the definitive abutment for this case (Fig 31).
vi: A synOcta gold abutment was selected as the definitive abutment for this case (Hình 31).

source: A synOcta temporary mesoabutment was selected for use as an interim abutment (Fig 10).
vi: A synOcta temporary mesoabutment was selected for use as an interim abutment (Hình 10).

source: A thick-gingiva biotype can be low-risk when replacing single missing teeth in the anterior area.
vi: Một dạng sinh học nướu dày có thể là nguy cơ thấp khi thay thế một răng mát ở phía trước

source: A transparent silicone key helped precisely assess the space available for the acrylic resin to be used for veneering (Figs 15a, b).
vi: A transparent silicone key helped precisely assess the space available for the acrylic resin to be used for veneering (Hình 15a, b).

source: A well-designed interim restoration will not only provide esthetic relief for the patient, but will help protect the tissue as it matures during the healing phase (Markus, 1999).
vi: Một phục hồi tạm thời được thiết kế tốt sẽ không chỉ cung cấp thẩm mỹ cho bệnh nhân, mà còn giúp bảo vệ các mô hạn trong giai đoạn chữa bệnh (Markus, 1999).

source: A working group was elected for the exploration of each topic.
vi: Một nhóm làm việc được bầu làm cho việc khám phá từng chủ đề.

source: A dvanced
vi: A dvanced (nâng cao)

source: Absence of medical risk factors
vi: Không có yếu tố nguy cơ y khoa

source: Absence of periodontal or occlusal disease, high levels of hygiene and compliance
vi: Không có bệnh nha chu hoặc khớp cắn, vệ sinh răng miệng và tuân thủ điều trị mức độ cao

source: Absent
vi: Không

source: Accepted dental procedures, including diagnostic wax-ups and photographs, are important to this visualization.
vi: Các phương pháp nha khoa được chấp nhận, bao gồm chẩn mẫu sáp chẩn đoán và hình ảnh là rất quan trọng để hình dung.

source: Access to that area is similar to the procedure for extracting a third molar.
vi: Tiếp cận vùng này tương tự như thủ thuật nhổ răng khôn.

source: Access to the Internet has helped educate patients on how dental implants are used to replace missing teeth.
vi: Truy cập Internet đã giúp giáo dục bệnh nhân về cách cấy ghép nha khoa được sử dụng để thay thế răng bị mất.

source: Achieving such an outcome presupposes a clear understanding of dental esthetics and general esthetic principles, and depends on the treatment team developing an acute diagnostic acumen.
vi: Đạt được kết quả như vậy bao hàm một sự hiểu biết rõ ràng về thẩm mỹ nha khoa và các nguyên tắc thẩm mỹ nói chung, và phụ thuộc vào nhóm điều trị phát triển chẩn đoán chính xác..

source: Acknowledgment
vi: Lời cảm ơn

source: Acknowledgments
vi: Lời cảm ơn

source: Active periodontal disease
vi: Bệnh nha chu hoạt động.

source: Active periodontal or occlusal disease, poor levels of hygiene and compliance
vi: Bệnh cắn khớp hoặc bệnh nha chu cấp, vệ sinh răng miệng và tuân thủ điều trị kém

source: Acute
vi: Cấp

source: Additional reports of 95%-100% success rates for rough-surface, unsplinted, early-loaded implants in the mandible are available (Payne and coworkers, 2003; Turkyilmaz and coworkers, 2006).
vi: Các báo cáo khác với tỉ ltỉ lệ thành công 95%-100% của implant tải lực sớm, bề mặt nhám, không liên kết trên hàm dưới là có sẵn (Payne and coworkers, 2003; Turkyilmaz and coworkers, 2006).

source: Additionally, Attard and Zarb (2005) compiled data for mandibular cases constructed with two implants with and without bars indicating high predictability, although they noted that most of the unsplinted implants may not have received full occlusal forces during healing.
vi: Ngoài ra, Attard và Zarb (2005) biên soạn dữ liệu cho hàm dưới trường hợp thiết kế với hai implant với không có thanh nối cho thấy khả năng dự đoán cao, mặc dù họ lưu ý rằng hầu hết các implant không liên kết có thể không nhận được toàn bộ lực khớp cắn khi lành thương.

source: Adequate
vi: Đầy đủ

source: Adequate horizontal tissue thickness existed to allow for good “root-form” emergence of the proposed implant restoration (Fig 4).
vi: Adequate horizontal tissue thickness existed to allow for good “root-form” emergence of the proposed implant restoration (Hình 4).

source: Adhering to these principles, numerous authors documented hundreds of successful mandibular cases and implants with success rates in the 96%-100% range, generally equaling those expected of conventional or early loading protocols for edentulous mandibles (Testori and coworkers, 2003; Wolfinger and Balshi, 2003; Horiuchi and coworkers, 2000; Cooper and coworkers, 2002).
vi: Tôn trọng những nguyên tắc, rất nhiều tác giả báo cáo hàng trăm ca thành công hàm dưới và cấy ghép với tỷ lệ thành công 96% đến 100% thường bằng những dự kiến của quy trình tải lực sớm hoặc thông thường cho hàm dưới mất răng toàn bộ (Testori và đồng nghiệp, 2003; Wolfinger và Balshi Năm 2003, Rio, và đồng nghiệp, 2000; Cooper và đồng nghiệp năm 2002).

source: Adjacent teeth with restorations extending into the gingival sulcus, however, represent a serious threat.
vi: Răng kế cận sẽ phục hồi mở rộng vào rãnh nướu, tuy nhiên, có mối đe doạ nghiêm trọng

source: Adjacent teeth, periodontal support, and existing hard and soft tissues are all critical factors when planning for a predictable esthetic result.
vi: Răng kế cận, mô nha chu, và mô cứng và mô mềm hiện tại mềm là những yếu tố quan trọng khi lập kế hoạch cho một kết quả thẩm mỹ có thể dự đoán.

source: Adjustments to the ceramic surface were followed by a polishing procedure with diamond-impregnated discs that help to create a glaze-like surface on the ceramic.
vi: Điều chỉnh bề mặt sứ bằng thủ thuật đánh bóng với đĩa đánh bóng giúp tạo ra bề mặt giống men trên sứ..

source: Advanced
vi: Nâng cao

source: After 6 weeks of healing, the patient was evaluated and the soft tissue response was considered excellent (Fig 5).
vi: Sau 6 tuần lành thương, bệnh nhân đã được đánh giá và mô mềm phản ứng tuyệt vời (Hình 5)

source: After 6 weeks, a prosthetic abutment was hand-torqued and a provisional restoration was attached out of occlusion.
vi: Sau 6 tuần, cùi răng được gắn và phục hình tạm hở khớp.

source: After a periosteal releasing incision, the flap was carefully mobilized, repositioned free of tension, and sutured with non-resorbable suture material, allowing the implant to heal in a semi-submerged mode (Fig 14).
vi: After a periosteal releasing incision, the flap was carefully mobilized, repositioned free of tension, and sutured with non-resorbable suture material, allowing the implant to heal in a semi-submerged mode (Hình 14).

source: After a soft-tissue maturation phase of three months, a custom impression cap was produced, capturing the shape of the provisional crown’s cervical portion and transferring it to the prefabricated impression cap (Fig 26).
vi: After a soft-tissue maturation phase of three months, a custom impression cap was produced, capturing the shape of the provisional crown’s cervical portion and transferring it to the prefabricated impression cap (Hình 26).

source: After an additional sintering step, the transocclusally screw-retained ceramo-metal implant-supported crown 21 was finalized and mechanically polished to the same characteristic surface texture observed at tooth 11 (Figs 24a, b).
vi: After an additional sintering step, the transocclusally screw-retained ceramo-metal implant-supported crown 21 was finalized and mechanically polished to the same characteristic surface texture observed at tooth 11 (Hình 24a, b).

source: After casting, ceramic material was built up and glazed and the fit of the restoration tested on a solid master cast (Figs 23a, b).
vi: After casting, ceramic material was built up and glazed and the fit of the restoration tested on a solid master cast (Hình 23a, b).

source: After complete setting of the impression material, the screw of the impression cap was loosened through the custom-made impression tray’s access hole for removal of the impression (Fig 22).
vi: After complete setting of the impression material, the screw of the impression cap was loosened through the custom-made impression tray’s access hole for removal of the impression (Hình 22).

source: After considering all the treatment options, the patient elected and consented to pursue treatment option 3 (two implants and a cantilevered fixed dental prosthesis).
vi: Sau khi xem xét tất cả chọn lựa điều trị, bệnh nhân chọn và đồng ý chọn lựa điều trị 3 (hai implant và phục hình cố định nhịp vói).

source: After de-epithelialization, a U-shaped incision was made above the implant shoulder, with the opening of the U pointing toward the labial aspect (Fig 25).
vi: After de-epithelialization, a U-shaped incision was made above the implant shoulder, with the opening of the U pointing toward the labial aspect (Hình 25).

source: After elevation of a mucoperiostealflap, a localized, confined bone defect comprising both a horizontal and a significant vertical component became apparent at site 21 (Figs 4a, b).
vi: After elevation of a mucoperiostealflap, a localized, confined bone defect comprising both a horizontal and a significant vertical component became apparent at site 21 (Hình 4a, b).

source: After evaluating all the different treatment options, it was decided to extract tooth 16 and replace it with a dental implant and crown.
vi: Sau khi đánh giá tất cả những chọn lựa điều trị khác nhau, đã quyết định nhổ răng 16 và cấy ghép implant và phục hình mão răng.

source: After implant placement, the implant shoulder was located in the desired, formerly planned position about 2 mm apical to the future soft-tissue margin around the implant-supported crown (Fig 12).
vi: After implant placement, the implant shoulder was located in the desired, formerly planned position about 2 mm apical to the future soft-tissue margin around the implant-supported crown (Hình 12).

source: After implant-bed preparation, which included minimal bone scalloping, a Standard Implant was placed (Fig 20).
vi: After implant-bed preparation, which included minimal bone scalloping, a Standard Implant was placed (Hình 20).

source: After implantation and soft-tissue grafting, a periapical radiograph was taken (Fig 24).
vi: After implantation and soft-tissue grafting, a periapical radiograph was taken (Hình 24).

source: After placement of the NN titanium copings on the implants and tightening to 15 Ncm, indicator grooves were prepared on the surface with a high-speed carbide bur to help obtain the correct reduction and angulations while the definitive finishing was performed extraorally (Figs 20a-d).
vi: Sau khi đặt NN titanium copings trên implant và siết với lực 15 Ncm, chuẩn bị rãnh hướng dẫn trên bề mặt implant với tay high-speed mũi khoan carbide để giúp mài bớt và góc ngoài miệng (Hình 20a-d).

source: After placement of the labially beveled healing cap and suturing, a periapical radiograph was taken (Fig 10).
vi: After placement of the labially beveled healing cap and suturing, a periapical radiograph was taken (Hình 10).

source: After re-entry (Fig 19) and removal of the membrane, the augmentation procedure could be considered a success, as a favorable bone contour and volume were present at the implant site (Fig 20).
vi: After re-entry (Hình 19) and removal of the membrane, the augmentation procedure could be considered a success, as a favorable bone contour and volume were present at the implant site (Hình 20).

source: After removal of the previous provisional and solid abutment, the custom provisional abutment was tightened to 15 Ncm, and the second provisional with improved emergence profiles was cemented with temporary cement (Figs 21a-c).
vi: After removal of the previous provisional and solid abutment, the custom provisional abutment was tightened to 15 Ncm, and the second provisional with improved emergence profiles was cemented with temporary cement (Hình 21a-c).

source: After removal of the provisionals and copings, the tissue maturation in the transition zone can be appreciated (Fig 28).
vi: Sau khi gỡ phục hình tạm và copings, sự trưởng thành mô vùng chuyển tiếp có thể được đánh giá cao (Hình 28).

source: After removal of the transfer post, the healing cap was placed and the tissue closed with a 4-0 vicryl suture (Figs 17a, b).
vi: After removal of the transfer post, the healing cap was placed and the tissue closed with a 4-0 vicryl suture (Hình 17a, b).

source: After shaping the In-Ceram blank, special attention was paid to checking the precise dimensions of its marginal aspect and the position of the future cement line, and the respective minimal dimensions necessary for optimum mechanical stability (Fig 42).
vi: After shaping the In-Ceram blank, special attention was paid to checking the precise dimensions of its marginal aspect and the position of the future cement line, and the respective minimal dimensions necessary for optimum mechanical stability (Hình 42).

source: After six weeks, bone healing for implants with an SLA (Sandblasted, Large-grit, Acid-etched) surface will have sufficiently progressed in standard sites without peri-implant bone defects.
vi: Sau sáu tuần, lành thương xương cho implant với SLA (Sandblasted, Large-grit, Acid-etched) bề mặt sẽ có tiến triển đầy đủ trong vùng chuẩn không khiếm khuyết xương quanh implant.

source: After surgery, the existing partial denture was shortened and put in place (Fig 30).
vi: Sau phẫu thuật, hàm bán phần có sẵn được làm ngắn và gắn (Hình 30).

source: After ten days of uneventful soft-tissue healing, the temporary restoration was relined for the patient’s subjective comfort and to improve the esthetic appearance in the region of the anterior maxilla (Fig 23).
vi: After ten days of uneventful soft-tissue healing, the temporary restoration was relined for the patient’s subjective comfort and to improve the esthetic appearance in the region of the anterior maxilla (Hình 23).

source: After the abutment was cast, it was then opaqued, followed by a ceramic buildup designed to support the soft-tissue analog and maintain a submucosal margin position (Figs 33a-c).
vi: After the abutment was cast, it was then opaqued, followed by a ceramic buildup designed to support the soft-tissue analog and maintain a submucosal margin position (Hình 33a-c).

source: After the completion phase of the temporary implant restoration, which comprises its general shape, cervical emergence profile, interproximal contacts, occlusal features, surface texture characteristics, and shade, the provisional can be either mechanically polished or glazed with a light-curing varnish and subsequently inserted in the patient’s mouth (Figs 18a, b).
vi: After the completion phase of the temporary implant restoration, which comprises its general shape, cervical emergence profile, interproximal contacts, occlusal features, surface texture characteristics, and shade, the provisional can be either mechanically polished or glazed with a light-curing varnish and subsequently inserted in the patient’s mouth (Hình 18a, b).

source: After the consultation, the data obtained were compiled for the esthetic risk-assessment table (Table 1).
vi: Sau khi tham khảo ý kiến, dữ liệu thu được biên soạn cho bảng đánh giá nguy cơ (Bảng 1).

source: After the first bake, the shape and fit of the all-ceramic crowns were checked on the model (Fig 49).
vi: After the first bake, the shape and fit of the all-ceramic crowns were checked on the model (Hình 49).

source: After the first ceramic firing, the volume contraction was particularly evident at the interproximal surfaces, resulting in an absence of interdental contacts (Fig 22b) and requiring at least one additional correction-sintering step.
vi: After the first ceramic firing, the volume contraction was particularly evident at the interproximal surfaces, resulting in an absence of interdental contacts (Hình 22b) and requiring at least one additional correction-sintering step.

source: After the healing cap was removed, the mucosa was stable and well established (Fig 41).
vi: After the healing cap was removed, the mucosa was stable and well established (Hình 41).

source: After the implant bed is prepared, the facial bone wall should be intact.
vi: Sau khi sửa soạn lỗ đặt implant, xương phía ngoài nên còn nguyên vẹn

source: After the infiltration process that gave the porously sintered, chalky blank its final strength and stability, the cervical portion was stained according to the dentine color of neighboring tooth 12 (Fig 48).
vi: After the infiltration process that gave the porously sintered, chalky blank its final strength and stability, the cervical portion was stained according to the dentine color of neighboring tooth 12 (Hình 48).

source: After the placement of the healing cap and suturing, a periapical radiograph was taken (Figs 12a-c).
vi: After the placement of the healing cap and suturing, a periapical radiograph was taken (Hình 12a-c).

source: After the removal of the healing cap, a titanium coping was hand-tightened, and indicator grooves were prepared on the surface with a high-speed carbide bur that would assist in an appropriate reduction extraorally (Figs 14a, b).
vi: After the removal of the healing cap, a titanium coping was hand-tightened, and indicator grooves were prepared on the surface with a high-speed carbide bur that would assist in an appropriate reduction extraorally (Hình 14a, b).

source: After the second bake, the crowns integrated harmoniously with the existing dentition (Fig 50).
vi: After the second bake, the crowns integrated harmoniously with the existing dentition (Hình 50).

source: After the second ceramic firing, the ceramist outlined in pencil the key morphological parameters on both the natural contralateral tooth and on the newly produced ceramo-metal implant-supported crown (Fig 23).
vi: After the second ceramic firing, the ceramist outlined in pencil the key morphological parameters on both the natural contralateral tooth and on the newly produced ceramo-metal implant-supported crown (Hình 23).

source: After the silicone had set, the crown was removed by loosening the occlusal screw so that a precise copy of its cervical shape was captured within the silicone (Fig 34).
vi: After the silicone had set, the crown was removed by loosening the occlusal screw so that a precise copy of its cervical shape was captured within the silicone (Hình 34).

source: After the verification of the articulation records, the framework was returned to the laboratory for ceramic application (Figs 21-23).
vi: Sau khi kiểm tra dấu cắn, khung sườn được trả lại labo để làm sứ (Figs 21-23).

source: After this procedure, a labially beveled healing cap was inserted onto the implant to ensure access to the implant shoulder and to start the soft-tissue conditioning phase (Fig 28).
vi: After this procedure, a labially beveled healing cap was inserted onto the implant to ensure access to the implant shoulder and to start the soft-tissue conditioning phase (Hình 28).

source: After this second sintering process, followed by some final adjustments with rotary instruments, the implant-supported crown was ready for the clinical try-in (Fig 41b).
vi: After this second sintering process, followed by some final adjustments with rotary instruments, the implant-supported crown was ready for the clinical try-in (Hình 41b).

source: After two weeks, the patient returned for a post-insertion evaluation and the insertion of a habit appliance.
vi: Sau 2 tuần, bệnh nhân quay lại để đánh giá gắn chốt và gắn khí cụ chức năng.

source: Again, a silicone key was used to determine the ideal shape of the crown (Fig 61).
vi: Again, a silicone key was used to determine the ideal shape of the crown (Hình 61).

source: Again, special attention was paid to the evaluation of the position of the mucosal margin in relation to the preparation margin of the blank and its cervical, submucosal aspect (Fig 45).
vi: Again, special attention was paid to the evaluation of the position of the mucosal margin in relation to the preparation margin of the blank and its cervical, submucosal aspect (Hình 45).

source: Again, the implants are characterized by a rough titanium surface and allowed to heal for at least 6 weeks, and the site is characterized by type 1, 2 or 3 bone.
vi: Một lần nữa, các implant nên có đặc tình bề mặt titanium nhám và để lành thương ít nhất 6 tuần, và vùng cấy ghép có xương loại 1, 2, hoặc 3.

source: All other authors report success rates of 96%-100% for integration.
vi: Tất cả tác giả khác báo cáo tỉ lệ thành công tích hợp xương 96%-100%.

source: All other clinical parameters between the groups were similar.
vi: Tất cả các tham số lâm sàng giữa các nhóm tương tự nhau

source: All tissues appeared to be healthy and no radiographic abnormality was detected (Fig 33).
vi: Tất cả mô khoẻ mạnh và không có dấu hiệu bất thường trên phim X quang (Hình 33).

source: Also due to the root resorption, the alveolus was quite shallow (Fig 11).
vi: Also due to the root resorption, the alveolus was quite shallow (Hình 11).

source: Also in the orofacial dimension, the implant shoulder was placed in an ideal position, i.e. about 1 mm palatally of the point of emergence of the adjacent teeth (Figs 19, 20).
vi: Also in the orofacial dimension, the implant shoulder was placed in an ideal position, i.e. about 1 mm palatally of the point of emergence of the adjacent teeth (Hình 19, 20).

source: Alternative restorative methods should be duly considered before planning for dental implant therapy.
vi: Phương pháp phục hồi thay thế cần được được xem xét trước khi lên kế hoạch điều trị cấy ghép nha khoa.

source: Although implant-supported restorations in this environment are rarely associated with long and complete papillae, it should be noted that this is often in harmony with the patient’s natural state.
vi: Mặc dù phục hồi trên implant trong môi trường này hiếm khi được kết hợp với các nhú nướu dài và đầy đủ, cần lưu ý rằng điều này thường là trong sự hòa hợp với trạng thái tự nhiên của bệnh nhân.

source: Although the implant was ideally placed in all comfort zones, the improper use of the titanium coping resulted in an unesthetic appearance.
vi: Mặc dù implant đã được lý tưởng đặt ở tất cả các vùng an toàn, việc sử dụng không đúng các titanium coping dẫn đến vẻ ngoài không thẩm mỹ

source: Although the zirconium-dioxide custom abutment featured a certain degree of translucency, its slightly “whitish” appearance (Fig 38a) made a minor preliminary color modification necessary, creating a more dentine-like appearance (Fig 38b) and facilitating the subsequent esthetic veneering (Andersson and coworkers, 2001).
vi: Although the zirconium-dioxide custom abutment featured a certain degree of translucency, its slightly “whitish” appearance (Hình 38a) made a minor preliminary color modification necessary, creating a more dentine-like appearance (Hình 38b) and facilitating the subsequent esthetic veneering (Andersson and coworkers, 2001).

source: Alveolar crest without bone deficiency
vi: Mào xương ổ không thiếu hụt

source: Ample data exists to confirm long-term predictability for this treatment modality.
vi: Dữ liệu phong phú tồn tại để xác nhận khả năng dự báo dài hạn cho các phương pháp điều trị này.
